# GlazingTransmissionColor Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedGlazing..::..GlazingTransmissionColor Property
AdvancedGlazing Class See Also
---
The property labeled "Transmissive color" from the "AdvancedGlazing" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static string GlazingTransmissionColor { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GlazingTransmissionColor As String
	Get
```

Visual C++
---
```text
public:
static property String^ GlazingTransmissionColor {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.
# See Also
AdvancedGlazing Class
Autodesk.Revit.DB.Visual Namespace